tiborsimon/embedded-tdd-headers/pic/8bit/pic18f6620_tdd.h
#define CCP3IF                        522
#define RXBNIF                        523
#define CCP4IF                        524
#define CCP5IF                        525
#define TMR4IF                        526
#define TXBNIF                        527
#define TX2IF                         528
#define RC2IF                         529
#define IPR3                          530
#define CCP3IP                        531
#define CCP4IP                        532
#define RXBNIP                        533
#define CCP5IP                        534
#define TMR4IP                        535
#define TX2IP                         536
#define TXBNIP                        537
#define RC2IP                         538
#define EECON1                        539
#define EECON1_RD                     540
#define EECON1_WR                     541
#define WREN                          542
#define WRERR                         543
#define FREE                          544
#define CFGS                          545
#define EEFS                          546
#define EEPGD                         547
#define RCSTA1                        548
#define RCSTA1_RX9D                   549
#define RX9D1                         550
#define RCSTA1_RCD8                   551
#define RCSTA1_OERR                   552
#define OERR1                         553
#define RCSTA1_FERR                   554
#define FERR1                         555
#define RCSTA1_ADDEN                  556
#define RCSTA1_ADEN                   557
#define ADDEN1                        558
#define RCSTA1_CREN                   559
#define CREN1                         560
#define SRENA                         561
#define SREN1                         562
#define RCSTA1_SREN                   563
#define RCSTA1_NOT_RC8                564
#define RCSTA1_RC9                    565
#define RCSTA1_nRC8                   566
#define RCSTA1_RC8_9                  567
#define RCSTA1_RX9                    568
#define RX91                          569
#define RCSTA1_SPEN                   570
#define SPEN1                         571
#define TXSTA1                        572
#define TX9D1                         573
#define TXSTA1_TX9D                   574
#define TXSTA1_TXD8                   575
#define TRMT1                         576
#define TXSTA1_TRMT                   577
#define BRGH1                         578
#define TXSTA1_BRGH                   579
#define SENDB1                        580
#define SENDB                         581
#define TXSTA1_SYNC                   582
#define SYNC1                         583
#define TXEN1                         584
#define TXSTA1_TXEN                   585
#define TX91                          586
#define TXSTA1_NOT_TX8                587
#define TXSTA1_TX8_9                  588
#define TXSTA1_TX9                    589
#define TXSTA1_nTX8                   590
#define TXSTA1_CSRC                   591
#define CSRC1                         592
#define PSPCON                        593
#define PSPMODE                       594
#define IBOV                          595
#define OBF                           596
#define IBF                           597
#define T3CON                         598
#define TMR3ON                        599
#define TMR3CS                        600
#define nT3SYNC                       601
#define T3NSYNC                       602
#define NOT_T3SYNC                    603
#define T3SYNC                        604
#define T3INSYNC                      605
#define SOSCEN3                       606
#define T3CCP1                        607
#define T3CKPS                        608
#define T3CKPS0                       609
#define T3CKPS1                       610
#define T3CCP2                        611
#define T3CON_RD16                    612
#define RD163                         613
#define T3RD16                        614
#define CMCON                         615
#define CM                            616
#define CMEN0                         617
#define CM0                           618
#define CMEN1                         619
#define CM1                           620
#define CMEN2                         621
#define CM2                           622
#define CIS                           623
#define C1INV                         624
#define C2INV                         625
#define CMCON_C1OUT                   626
#define CMCON_C2OUT                   627
#define CVRCON                        628
#define CVR                           629
#define CVR0                          630
#define CVR1                          631
#define CVR2                          632
#define CVR3                          633
#define CVRCON_CVREF                  634
#define CVRSS                         635
#define CVRR                          636
#define CVROEN                        637
#define CVROE                         638
#define CVREN                         639
#define CCP3CON                       640
#define CCP3M                         641
#define CCP3M0                        642
#define CCP3M1                        643
#define CCP3M2                        644
#define CCP3M3                        645
#define DCCP3Y                        646
#define DC3B                          647
#define DC3B0                         648
#define DC3B1                         649
#define DCCP3X                        650
#define CCP2CON                       651
#define CCP2M                         652
#define CCP2M0                        653
#define CCP2M1                        654
#define CCP2M2                        655
#define CCP2M3                        656
#define DC2B0                         657
#define DCCP2Y                        658
#define CCP2Y                         659
#define DC2B                          660
#define DC2B1                         661
#define DCCP2X                        662
#define CCP2X                         663
#define CCP1CON                       664
#define CCP1M0                        665
#define CCP1M                         666
#define CCP1M1                        667
#define CCP1M2                        668
#define CCP1M3                        669
#define DCCP1Y                        670
#define CCP1Y                         671
#define DC1B                          672
#define DC1B0                         673
#define CCP1X                         674
#define DCCP1X                        675
#define DC1B1                         676
#define ADCON2                        677
#define ADCS                          678
#define ADCS0                         679
#define ADCS1                         680
#define ADCS2                         681
#define ADFM                          682
#define ADCON1                        683
#define PCFG0                         684
#define PCFG                          685
#define PCFG1                         686
#define PCFG2                         687
#define CHSN3                         688
#define PCFG3                         689
#define VCFG                          690
#define VCFG0                         691
#define VCFG01                        692
#define VCFG11                        693
#define VCFG1                         694
#define ADCON0                        695
#define ADON                          696
#define nDONE                         697
#define GO_nDONE                      698
#define NOT_DONE                      699
#define GODONE                        700
#define GO_DONE                       701
#define DONE                          702
#define GO_NOT_DONE                   703
#define GO                            704
#define CHS0                          705
#define CHS                           706
#define CHS1                          707
#define CHS2                          708
#define CHS3                          709
#define SSPCON2                       710
#define SEN                           711
#define RSEN                          712
#define PEN                           713
#define RCEN                          714
#define ACKEN                         715
#define ACKDT                         716
#define ACKSTAT                       717
#define GCEN                          718
#define SSPCON1                       719
#define SSPM0                         720
#define SSPM                          721
#define SSPM1                         722
#define SSPM2                         723
#define SSPM3                         724
#define CKP                           725
#define SSPEN                         726
#define SSPOV                         727
#define WCOL                          728
#define SSPSTAT                       729
#define BF                            730
#define UA                            731
#define R_NOT_W                       732
#define READ_WRITE                    733
#define NOT_W                         734
#define R_W                           735
#define nW                            736
#define RW                            737
#define nWRITE                        738
#define R                             739
#define NOT_WRITE                     740
#define R_nW                          741
#define I2C_READ                      742
#define START                         743
#define S                             744
#define I2C_START                     745
#define STOP                          746
#define I2C_STOP                      747
#define P                             748
#define NOT_A                         749
#define DATA_ADDRESS                  750
#define nA                            751
#define D_A                           752
#define D_nA                          753
#define D                             754
#define DA                            755
#define D_NOT_A                       756
#define NOT_ADDRESS                   757
#define nADDRESS                      758
#define I2C_DAT                       759
#define CKE                           760
#define SMP                           761
#define T2CON                         762
#define T2CKPS0                       763
#define T2CKPS                        764
#define T2CKPS1                       765
#define TMR2ON                        766
#define T2OUTPS0                      767
#define T2OUTPS                       768
#define T2OUTPS1                      769
#define T2OUTPS2                      770
#define T2OUTPS3                      771
#define PR2                           772
#define WM0                           773
#define WM1                           774
#define WAIT0                         775
#define WAIT1                         776
#define EBDIS                         777
#define T1CON                         778
#define TMR1ON                        779
#define TMR1CS                        780
#define NOT_T1SYNC                    781
#define T1SYNC                        782
#define nT1SYNC                       783
#define T1INSYNC                      784
#define T1OSCEN                       785
#define SOSCEN                        786
#define T1CKPS0                       787
#define T1CKPS                        788
#define T1CKPS1                       789
#define T1RD16                        790
#define T1CON_RD16                    791
#define RCON                          792
#define BOR                           793
#define NOT_BOR                       794
#define nBOR                          795
#define POR                           796
#define nPOR                          797
#define NOT_POR                       798
#define nPD                           799
#define NOT_PD                        800
#define PD                            801
#define NOT_TO                        802
#define nTO                           803
#define TO                            804
#define nRI                           805
#define NOT_RI                        806
#define RI                            807
#define nIPEN                         808
#define IPEN                          809
#define NOT_IPEN                      810
#define WDTCON                        811
#define SWDTE                         812
#define SWDTEN                        813
#define LVDCON                        814
#define LVV0                          815
#define LVDL0                         816
#define LVDL                          817
#define LVV1                          818
#define LVDL1                         819
#define LVV2                          820
#define LVDL2                         821
#define LVV3                          822
#define LVDL3                         823
#define LVDEN                         824
#define BGST                          825
#define IRVST                         826
#define OSCCON                        827
#define SCS                           828
#define T0CON                         829
#define T0PS                          830
#define T0PS0                         831
#define T0PS1                         832
#define T0PS2                         833
#define PSA                           834
#define T0SE                          835
#define T0CS                          836
#define T08BIT                        837
#define TMR0ON                        838
#define STATUS                        839
#define C                             840
#define CARRY                         841
#define DC                            842
#define ZERO                          843
#define Z                             844
#define OV                            845
#define OVERFLOW                      846
#define N                             847
#define NEGATIVE                      848
#define INTCON3                       849
#define INT1IF                        850
#define INT1F                         851
#define INT2IF                        852
#define INT2F                         853
#define INT3F                         854
#define INT3IF                        855
#define INT1E                         856
#define INT1IE                        857
#define INT2IE                        858
#define INT2E                         859
#define INT3E                         860
#define INT3IE                        861
#define INT1P                         862
#define INT1IP                        863
#define INT2IP                        864
#define INT2P                         865
#define INTCON2                       866
#define RBIP                          867
#define INT3IP                        868
#define INT3P                         869
#define TMR0IP                        870
#define T0IP                          871
#define INTEDG3                       872
#define INTEDG2                       873
#define INTEDG1                       874
#define INTEDG0                       875
#define RBPU                          876
#define NOT_RBPU                      877
#define nRBPU                         878
#define INTCON                        879
#define RBIF                          880
#define INT0F                         881
#define INT0IF                        882
#define T0IF                          883
#define TMR0IF                        884
#define RBIE                          885
#define INT0E                         886
#define INT0IE                        887
#define T0IE                          888
#define TMR0IE                        889
#define PEIE                          890
#define PEIE_GIEL                     891
#define GIEL                          892
#define GIE_GIEH                      893
#define GIE                           894
#define GIEH                          895
#define STKPTR0                       896
#define STKPTR                        897
#define SP0                           898
#define STKPTR1                       899
#define SP1                           900
#define STKPTR2                       901
#define SP2                           902
#define SP3                           903
#define STKPTR3                       904
#define STKPTR4                       905
#define SP4                           906
#define STKUNF                        907
#define STKOVF                        908
#define STKFUL                        909

#endif // _PIC18F6620_H_
